# @System   :   Arch Linux
# @Author   :   MR.申
# @Time     :   2024/7/19 下午2:58
# @Note     :   仅作学习使用--禁止传播，违者必究✅

# 0b110001100转十进制 256+128+8+4=396
print(0b110001100)
# 0o2456转十进制 6+5*8+4*64+2*8*64
print(0o2456)
# 0xA45转十进制 5+4*16+10*16*16
print(0xA45)

# 123转二进制        1111011
print(bin(123))
# 678转八进制           1246
print(oct(678))
# 8912转十六进制        22D0
print(hex(8912))

# 0b11100101 转八进制      345
print(oct(0b11100101))
# 0b1110010110 转十六进制   396
print(hex(0b1110010110))

# 0o1230转二进制   0010100110000
print(bin(0o1230))
# 0xAB29转二进制   1010101100101001
print(bin(0xAB29))
